export const PERMISSIONS = [
    { id: 'ADMINISTRATOR', name: 'Администратор', description: 'Предоставляет все разрешения, а также позволяет обходить ограничения каналов.' },
    { id: 'MANAGE_SERVER', name: 'Управление сервером', description: 'Позволяет менять имя сервера, баннер и регион.' },
    { id: 'MANAGE_CHANNELS', name: 'Управление каналами', description: 'Позволяет создавать, редактировать и удалять каналы.' },
    { id: 'MANAGE_ROLES', name: 'Управление ролями', description: 'Позволяет создавать новые роли и редактировать роли ниже этой.' },
    { id: 'KICK_MEMBERS', name: 'Выгонять участников', description: 'Позволяет выгонять участников с сервера.' },
    { id: 'BAN_MEMBERS', name: 'Банить участников', description: 'Позволяет банить участников на сервере.' },
    { id: 'VIEW_AUDIT_LOG', name: 'Просмотр журнала аудита', description: 'Позволяет просматривать журнал изменений сервера.' },
    { id: 'SEND_MESSAGES', name: 'Отправка сообщений', description: 'Позволяет отправлять сообщения в текстовые каналы.' },
    { id: 'MANAGE_MESSAGES', name: 'Управление сообщениями', description: 'Позволяет удалять сообщения других участников.' },
    { id: 'CONNECT', name: 'Подключение', description: 'Позволяет подключаться к голосовым каналам.' },
    { id: 'SPEAK', name: 'Говорить', description: 'Позволяет говорить в голосовых каналах.' },
];
